# Space_AddName

## Description
Add a new Space Name to the space object.

```pascal
PROCEDURE Space_AddName(
				space : HANDLE;
				name  : STRING);
```

```python
def vs.Space_AddName(space, name):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE|   |
|name|STRING|   |

## Version
Availability: from Vectorworks 2014

## Category
* SpaceObjectCoreTools